const keywords = [
    '如果', '否则', '使用', '命名空间', '返回',
    '静态', '动态', '导出', '公开', '定义',
    '数据类型', '类', '公有', '私有', '保护',
    '传址', '引用型', '赋值', '递增', '递减', '继承',
    '尝试', '捕获', '抛出', '异常', '抛出异常', '引用',
    '常量', '宏定义', '宏', '无符号', '静态转换', '动态转换',
    '常量转换', '强制转换', '模板', '可变参数', '自动', '变量',
    '引用型', '类型名', '析构', '构造', '且', '或',
    '否则如果', '如果真', '如果假', '条件判断', '分支', '默认',
    '判断循环', '首循环', '计次循环', '跳转标签', '跳转', '遍历数组',
    '跳出循环', '到循环尾', '返回', '整数', '短整数', '长整数',
    '超长整数', '无符号整数', '无符号短整数', '无符号长整数', '无符号超长整数', '整数指针',
    '无符号整数指针', '小数', '双精度小数', '高精度小数', '体积', '字符',
    '宽字符', '无符号字符', '无符号宽字符', '逻辑', '逻辑型', '真_W',
    '假_W', '字符串', '宽字符串', '文本', '宽文本', '文本数组',
    '宽文本数组', '字节集', '字节集指针', '字节集数组', '日期时间', '数组',
    '空', '空指针', '空值', '_空值', '支持库', '导入'
  ];

export {
  keywords
};